Channel_Username = "lImomentIl"
#long text
def send_long_message(chat_id, text, **kwargs):
    max_lenght = 4005
    for i in range (0, len(text) ,max_lenght):
        bot.send_message(chat_id, text[i:i+max_lenght], **kwargs)

# chek user
def UserInChannel(user_id):
    try:
        member = bot.get_chat_member(chat_id=f"@{Channel_Username}", user_id=user_id)
        if member.status in ["creator" , "administrator" , "member"]:
            return True
    except Exception as e:
        print(f"error : {e}")
    return False

# start command
@bot.message_handler(commands=['start'])
def start(message):
    user_id = message.from_user.id
    if UserInChannel(user_id):
        bot.reply_to(message,"""

        به ربات هاولر خوش آمدید!

برای سهولت کار میتوانید از دکمه ها استفاده کنید.
همچنین میتوانید از /help برای مشاهده دستورات به صورت مستقیم استفاده کنید.
برای ارتباط با پشتیبانی میتوانید از قسمت پشتیبانی با ما ارتباط برقرار کنید.
-------------------------------------------
Welcome to the Howler Bot!

For your convenience, you can use the buttons below.
You can also use the /help command to view the list of available commands directly.
If you need assistance, please contact us through the Support section.
        """)
    else:
        bot.reply_to(message,f"""
        لطفا برای استفاده از ربات ابتدا در کانال @{Channel_Username} عضو شوید.
--------------------------------------------------------
-he @{Channel_Username} channel first to use the bot.
        """)
# help command
@bot.message_handler(commands=['help'] )
@bot.message_handler(func=lambda m:m.text == "راهنما")
def help(message):
    user_id = message.from_user.id
    if UserInChannel(user_id):
        bot.reply_to(message, """
        لیست دستورات ربات هاولر

مشاهده تمام نقش های بازی
/AllRoll  - لیست نقش ها
مشاهده نقش های منفی
/DemonRoll  - نقش های منفی
مشاهده نقش های مثبت
/SafeRoll  - نقش های مثبت
مشاهده نقش های انفرادی
/AloneRoll – نقش های انفرادی
مشاهده گروه های معتبر بازی
/BESTGP – گروه ها
سایر خدمات
/Other – خدمات

        """)
    else:
        bot.reply_to(message, f"""
                لطفا برای استفاده از ربات ابتدا در کانال @{Channel_Username} عضو شوید.


Settings
 Logout        ---------------------------------------------------------------------------
        Please join the @{Channel_Username} channel first to use the bot.
                """)

# other command (ban kick mute pin )
@bot.message_handler(commands=['Other'] )
@bot.message_handler(func=lambda m:m.text == "خدمات")
def help(message):
    user_id = message.from_user.id
    if UserInChannel(user_id):
        bot.reply_to(message, """
        لیست دستورات خدماتی ربات هاولر

پین کردن پیام
/pin - پین
آن پین پیام
/unpin – حذف پین
خوشامد گویی فعال
/welcomon
خوشامد گویی غیرفعال
/welcomoff
بن کاربر
/ban – بن – سیک
حذف بن کاربر
/unban – حذف بن – آزادی
کیک کاربر
/kick – کیک - اخراج
سکوت کاربر
/mute – سکوت – خفه
حذف سکوت کاربر
/unmute – حذف سکوت 
–لطفا برای استفاده از ربات ابتدا در کانال @{Channel_Username} عضو شوید.
        ---------------------------------------------------------------------------
        Please join the @{Channel_Username} channel first to use the bot.
                """)
@bot.message_handler(commands=['AllRoll'])
@bot.message_handler(func=lambda m:m.text == "لیست نقش ها" )
def AllRoll(message):
    long_text = """
روستایی 👱
نقشت خیلی ساده‌ست: هدف زنده موندنه. هر شب می‌تونی در رأی‌گیری شرکت کنی — شاید بتونی یک گرگ رو محکوم به اعدام کنی.

گرگینه 🐺
تو عضو تیم گرگ‌ها هستی. هر شب می‌تونی یک نفر رو بخوری. اگر «مست» رو بخوری، شب بعد گرگ‌ها قادر به حمله نخواهند بود. اگر «نفرین‌شده» رو بخوری، او تبدیل به گرگ می‌شه. یادت باشه به قاتل حمله نکنی چون ممکنه اون‌تورو بکشه! 😱

مست 🍻
تو مثل یک روستایی عادی‌ای ولی وقتی گرگ‌ها تو رو می‌خورند، مسموم می‌شن و آن شب قادر به حمله نیستند.

پیشگو 👳
هر شب می‌تونی نقش واقعی یک بازیکن رو کشف کنی. مواظب باش هویتش لو نره چون گرگ‌ها ممکنه تو رو هدف قرار بدن.

نفرین‌شده 😾
در ظاهر یک روستایی ساده‌ای، اما اگر گرگ‌ها بهت حمله کنند تبدیل به گرگ می‌شی (قبل از حمله هنوز روستایی هستی).

فاحشه 💋
هر روز می‌تونی به خانه یک نفر بری؛ اگر اون شخص گرگ یا قاتل باشه، کشته می‌شی؛ ولی اگه روستایی باشه مشکلی برات پیش نمیاد. مراقب باش!

ناظر 👁
تو به عنوان ناظر از قبل اطلاع داری که چه کسی پیشگو واقعی است (نه پیشگوی تقلبی).

تفنگدار 🔫
هر شب می‌تونی به یک نفر شلیک کنی، اما همه می‌فهمن که تیر از کجا اومده. فقط دو گلوله داری — با احتیاط استفاده کن.

خائن 🖕
اول بازی مثل یک روستایی عادی هستی، ولی وقتی همه گرگ‌ها کشته شدند ممکنه به روستایی‌ها خیانت کنی و به تیم گرگ‌ها ملحق بشی — البته اگه تا آن زمان زنده مونده باشی.

فرشته نگهبان 👼
هر شب می‌تونی از یک نفر در برابر حمله محافظت کنی. مواظب باش که چه کسی رو انتخاب
 می‌کنی؛ اگر سعی کنی از یک گرگ محافظت کنی، ۵۰٪ احتمال داره خودت کشته بشی.

کارآگاه 🕵
هر روز می‌تونی نقش یک نفر رو بررسی کنی، اما در این کار ۳۰٪ احتمال داره لو بری و توسط گرگ‌ها خورده بشی.

پیشگوی رزرو 🙇
تو در ابتدا روستایی عادی‌ای، ولی اگر پیشگو بمیره تو جای اون رو می‌گیری و نقش پیشگو برات فعال می‌شه.

فرقه‌گرا 👤
رییس یک فرقه هستی؛ هدف‌ت اینه که همه بازیکنان باقی‌مونده رو به فرقه‌ات بپیوندونی. وقتی همه روستایی‌های زنده عضو فرقه‌ت شدن تو برنده‌ای.

شکارچی 💂
وظیفه‌ات مقابله با فرقه‌ها و حفاظت از روستایی‌هاست. هر شب می‌تونی خانه یک نفر رو بازدید کنی تا بفهمی عضو فرقه‌ست یا نه. اگه خونه یک گرگ بری، نمی‌تونی تشخیص بدی ولی زنده می‌مونی؛ اگر خونهٔ قاتل بری کشته می‌شی. اگر فرقه بیاد تو رو دعوت کنه، تو نفر تازه‌وارد فرقه رو می‌کشی.

بچه وحشی 👶
اوایل بازی یک الگو (ِrole model) انتخاب می‌کنی. اگر الگو بمیره، خودش تبدیل به گرگ می‌شه.

احمق 🃏
بهش گفته می‌شه که پیشگوئه، ولی وقتی سعی می‌کنه نقش کسی رو بفهمه، یک نقش تصادفی بهش نشون داده می‌شه (در واقع پیشگوی واقعی نیست).

فراماسون 👷
تو به‌ظاهر یک روستایی عادی‌ای اما دیگر فراماسون‌ها را می‌شناسی.

همزاد 🎭
تواناییت اینه که وارد وجود بقیه بشی: اوایل بازی یک نفر را انتخاب می‌کنی و هرگاه آن شخص بمیرد نقش او را به عهده می‌گیری. اگر همزاد نقش یک فرقه‌گرا را انتخاب کرده باشد، بعد از مرگ آن، نقش اصلی را کسب می‌کنی. یک همزاد تا وقتی جای کسی را نگرفته نمی‌تواند برنده شود — مگر اینکه عاشق شده باشد.

الههٔ عشق 💘
در آغاز بازی دو نفر را زوج می‌کنی تا عاشق هم شوند. اگر یکی از عاشق‌ها بمیرد، دیگری از غم می‌میرد. اگر در پایان یکی از عاشق‌ها برنده شود، دیگری هم به‌صورت خودکار برنده محسوب می‌شود حتی اگر در تیم مقابل باشد (مثلاً گرگ و روستایی).

کلانتر 🎯
اگر کشته بشی می‌تونی یک نفر رو با خودت به گور ببری. اما اگر توسط گرگ کشته بشی قضیه متفاوت می‌شه: وقتی فقط یک گرگ باقی باشه ۳۰٪ احتمال داره اون گرگ رو بکشی و زنده بمونی؛ برای هر گرگ اضافه ۲۰٪ به شانس اینکه یک گرگ رو بکشی اضافه می‌شه، ولی در این حالت خودت زنده نمی‌مونی.

قاتل زنجیره‌ای 🔪
تو یک بازیکن انفرادی و آزاد هستی؛ می‌تونی هر کاری بکنی. هد
ف اینه که آخر بازیکنی بمونی که به جز تو کسی زنده نمونه (استثناء: اگر عاشق شده باشی و عشقش زنده باشه، هر دو با هم می‌برید). اگر گرگ‌ها بهت حمله کنند، یکی از آن‌ها تبدیل به قاتل می‌شه و تو زنده می‌مونی؛ اما تیر و اعدام می‌تونن تو رو از بین ببرن.

منافق 👺
هدف منافق فقط یک چیزه: اعدام شدن. اگر منافق اعدام بشه، او برنده می‌شه و بقیه بازیکنان شکست می‌خورند.

کدخدا 🎖
اگر خودت را به عنوان کدخدا معرفی کنی، می‌تونی به هر بازیکن دو رأی بدی — اما این فقط وقتی اجرا می‌شه که رسماً اعلام کنی کدخدا هستی.

شاهزاده 👑
اگر در اولین باری که بیشترین رأی رو آوردی، رأی‌گیری علیه‌ات باشه، اعدام نمی‌شی؛ اما دفعات بعدی که بیشترین رأی بیاری اعدام خواهی شد.
جادوگر 🔮
این رقیب پیشگو هست؛ به گرگ‌ها کمک می‌کنه تا پیشگو رو پیدا کنن — یا به نوعی در جهت منافع گرگ‌ها عمل می‌کنه.

پسر گیج 🤕
خیلی گیج و مسته؛ صبح‌ها کلی الکل خورده و چون بات‌ها رأی‌های او رو قبول ندارن ممکنه رأیش در زمان رأی‌گیری توسط ربات تغییر کنه.

آهنگر ⚒
آهنگر کلی نقره داره که اون‌ها رو پخش می‌کنه تا راه گرگ‌ها به روستا بسته بشه (مانع نزدیک شدن گرگ‌ها می‌شه).

گرگ آلفا ⚡️
رهبر گرگ‌هاست. وقتی به کسی حمله می‌کنه ۲۰٪ احتمال داره که قربانی تبدیل به گرگ بشه.

تولهٔ گرگ 🐶
یک گرگ کوچک و محبوبِ جمع؛ اگر او بمیره، شب بعد گرگ‌ها برای انتقام دو نفر رو می‌کشند.

خواب‌گذار 💤
یک بار در طول بازی می‌تونه یک شب همه رو بخواب ببره؛ در آن شب هیچ‌کس نمی‌تونه از توانایی نقشش استفاده کنه.

پیشگوی نگاتیوی 🌀
هر شب می‌تونی از نقشی بپرسی، اما بهت گفته می‌شه چه نقشی نیست. فقط نقش‌هایی که هنوز زنده‌اند برایت گزارش می‌شن — بنابراین دقت کن در تفسیر اطلاعات.

گرگ‌نما 👱🌚
به ظاهر روستایی‌ای ولی چون زیاد تو جنگل بوده، وقتی پیشگو استعلام می‌کنه او را گرگ تشخیص می‌ده.

گرگ ایکس 🐺🌝
عضو تیم گرگ‌هاست ولی پیشگو او را به عنوان یک روستایی ساده می‌بیند.

صلح‌گرا ☮️
هر زمان بخواهی می‌تونی با حرف‌ها و احساساتت مردم را قانع کنی که رأی ندهند — در نتیجه هیچ‌کس اعدام نمی‌شه.

ریش‌سفید 📚
اگر گرگ‌ها تو رو بخورند، دفعهٔ اول زنده می‌مونی، دفعهٔ دوم کشته می‌شی. اگر یک روستایی با توانایی خاص تو رو بکشه، آن روستایی به خاطر عذاب وجدان توانایی‌اش را از دست می‌دهد و به روستایی ساده تبدیل می‌شه.

دزد 
😈
هر شب می‌تونی نقش یک نفر رو بدزدی؛ کسی که نقشش دزدیده شده تبدیل به دزد می‌شه و شب بعد می‌تونه نقش دیگری رو بدزده. اگر در پایان بازی دزد تنها بازمانده باشه، می‌بازه.

دردسرساز 🤯
یک نوجوان عصبانیه که وقتی شروع به جیغ و جنجال کنه، روز بعد روستا از کنترل خارج می‌شه و برای ساکت کردنش روز دو بار رأی‌گیری برگزار می‌کنند.

شیمیدان 👨‍🔬
یک دیوانهٔ خلاق که دو معجون می‌سازه؛ یکی از معجون‌ها بسیار کشنده‌ست. او معجون‌ها را روبروی بقیه می‌ذاره و مجبورشون می‌کنه یکی را بردارند و خودش معجون دیگر را می‌نوشه.

گرگِ برفی 🐺☃️
در کوهستان زندگی می‌کنه، استاد یخ و برف. می‌تونه یک نفر را یخ‌زده کنه؛ شخص یخ‌زده هیچ عملی نمی‌تونه انجام بده اما شب بعد از یخ‌زدگی در امان می‌مونه.

گورکن ☠️
هر شب قبر کسانی که تازه مردن را حفر می‌کنی (حتی گرگ‌ها). چون شب‌ها بیرون هستی، گرگ یا فرقه معمولاً نمی‌تونن پیدات کنن مگر اینکه هیچ کاری برای انجام نباشه؛ در این صورت تو خونه می‌مونی و ممکنه دیگران پیدات کنن. هرکس بهت سر بزنه ممکنه در یکی از قبرهای تازه بیافته — شانس این اتفاق بسته به تعداد قبرهایی که حفاری کردی فرق می‌کنه. قاتل سریالی ممکنه بفهمه تو خونه‌ای یا در بیرون ولی در حین کار ممکنه خودش آسیب ببینه.

آتش‌زن 🔥
مثل قاتل سریالی یک تک‌نفرهٔ خطرناک. هر شب ممکنه چند خانه رو به نفت آغشته کنی و سپس با یک جرقه همه اون‌هایی که در آن خانه‌ها هستن (حتی بازدیدکننده‌ها) رو به آتش بکشی. وقتی تنها بمونی برنده‌ای.

رمال 🦅
هر صبح با نگاه به پرندگان می‌تونی بفهمی کدام نقش حتماً در بازی حضور ندارد. پرنده‌ها هیچ‌وقت یک نقش را دوبار برایت تکرار نمی‌کنن؛ پس از اطلاعاتشون خوب استفاده کن.
    """
    send_long_message(message.chat.id, long_text)
@bot.message_handler(commands=['DemonRoll'])
@bot.message_handler(func=lambda m:m.text == "نقش های منفی")
def demonroll(message):
    bot.reply_to(message, """
    گرگ آلفا ⚡️
گرگینه 🐺
گرگ ایکس 🐺🌝
توله گرگ 🐶
گرگ برفی 🐺☃️
جادوگر 🔮
خائن 🖕
نفرین شده 😾
بچه وحشی 👶
فرقه گرا 👤
قاتل زنجیره ای 🔪
منافق 👺
آتش زن 🔥
    
    """)
@bot.message_handler(commands=["SafeRoll"])
@bot.message_handler(func=lambda m:m.text=="نقش های مثبت")
def SafeRoll(message):
   bot.reply_to(message,"""
   hi
   """)
bot.polling(print("version 1 is running..."))